[
  {
    "title": "TRIUMPH’S DISTINGUISHED GENTLEMAN’S RIDE RETURNS MAY 2021",
    "blogCategory": "MOTORCYCLE",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617370219/Bern-Switzerland_Tim-Loosli-3_wnujcv.jpg",
    "description": "The Distinguished Gentleman’s Ride — a fundraiser led by Triumph and Movember for prostate cancer research and men’s mental health — is ready to celebrate its tenth anniversary on May 23. Registration for this year’s DGR is open now, in cities all around the world. \n\nFounded in 2012, DGR has raised more than $27 million for men’s health, connecting hundreds of thousands of motorcycle riders from over 100 countries around the globe for this worthy cause. Triumph has an ambitious goal for 2021: to raise more than $2.55 million for charity partner Movember, bringing the grand total for the decade to $30 million. \n\nThe annual event brings together classic and vintage motorcycle enthusiasts, dressed in their Sunday best, riding to raise money and awareness of men’s health. This year, participants are encouraged to ride solo, as DGR is organizing events that comply with local COVID protocols.  \n\nThe whole idea for DGR was hatched when Mark Hawwa saw an image of one of television’s most iconic distinguished gentlemen, Mad Men’s Don Draper, riding a classic motorcycle while wearing a suit. Hawwa figured that gathering motorcycle enthusiasts for a charitable cause was the perfect pairing. \n\n“It’s unfathomable to think that 10 years ago, an idea to bring a few dapper men and women together on classic bikes to change the stereotypes of motorcyclists went viral,” Hawwa said in a press release. “Since then, we’ve made so many incredible connections and met so many inspiring people; all while raising a huge amount of funds and awareness for men’s health, on behalf of Movember. This year is a little different to most. Similarly to last year, with so many cities still under restrictions, we need to consider the safety of our global community. We look to organize COVID-safe events where possible, and for those who can’t, we encourage you to connect digitally and ride solo for men’s health and help us celebrate a decade of the event.” \n\nRiding for men’s health isn’t the only reason why you should join DGR. Triumph is rewarding some participants with incredible prizes, including four new motorcycles. The winner of the 2021 Gentlefolk Competition will receive a custom, 1-of-1 DGR x Triumph motorcycle. The top 50 fundraisers will also receive custom helmets from Hedon Helmets. Belstaff will provide classic motorcycle outfits for top fundraisers and sprint prizes for event fundraisers. \n\n“We at Triumph are proud to be the main partner for The Distinguished Gentleman’s Ride for the 8th consecutive year, and are also delighted to be celebrating the 10th-year anniversary of the initiative overall,” Paul Straud, Triumph’s Chief Commerical Officer, said in a press release. “Our relationship with the DGR is an incredibly important partnership – raising funds and awareness to fight prostate cancer and support men’s mental health is important to both Triumph and riders. As ever, progress to raise awareness and support is even more effective when it’s a lasting partnership where we can improve and evolve our collective activity year on year.” \n\nLearn more about the 2021 Distinguished Gentleman’s Ride and sign up or donate today! \n\nImage courtesy of Tim Loosli/Distinguished Gentleman's Ride.",
    "addedOn": "2020-04-20 06:30:00"
  },
  {
    "title": "THE BEST MOTORCYCLE ROAD TRIPS ON EACH CONTINENT",
    "blogCategory": "ROADS",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617370312/motorcycleroadtrip_qthi38.png",
    "description": "If you’re the type who ventures off the beaten path when traveling, instead of sticking with boring tourist destinations, you’ll want to bookmark this post. \n\nWe’ve scoured the globe, looking for the unique, incredible and memorable motorcycle rides you’ve got to take. Call it a bucket list if you want, but this is your guide to the best rides in the world. This has something for everyone, whether you want to bring the thunder in a Harley-Davidson or Indian, or explore territory cars can’t reach in a durable dirt bike. While Route 66 was officially decommissioned in 1985, you can still get your kicks on this L.A.-to-Chicago journey. Known as the Main Street of America, its place in U.S. history is legendary. Though most of it has been bypassed by interstate highways, you can still drive plenty of the original route on your way through California, Arizona, New Mexico, Texas, Oklahoma, Kansas, Missouri and Illinois.  \n\nThe breathtaking Santa Monica Pier is at the start (or end) of your journey, and you’ll have the chance to stop at several must-see attractions.  \n\nPark your bike next to the rest as you grab a bite to eat at the Olive Oatman Restaurant & Saloon in Oatman, AZ. Rest your head and take a trip back in time at the Blue Swallow Motel in Tucumcari, NM. Get your fill with a 72-oz steak at The Big Texan in Amarillo. The Vintage Iron Museum in Miami, Oklahoma features a collection of antique motorcycles, such as Evel Knievel memorabilia and a 1917 Harley that you’ve got to see.  \nNot for the faint of heart, this epic motorcycle trip provides a lifetime of memories. If you want incredible scenery and stories to tell for years, check this out. Leave the Harley at home and rent something that can take on some terrain, because the Lagunas Route is worth it. \n\nFrom MotoBirds: \n\n“Although Bolivia has several noteworthy paved routes, the Lagunas Route is easily our top choice. Pure off-road, this route starts in San Pedro de Atacama, Chile, and ends in Uyuni, Bolivia. The route takes you across the otherworldly Dali Desert, named after Salvador Dali for its surreal landscape, and along the beautifully colored high desert lakes inhabited by pink flamingos.” \n\nThis route takes you through Salar Celeste, also known as the Desert of Heaven, named for its majestic white sands. Salar Celeste is the largest salt flats in the world, so if you don’t go, you can at least score a few points at trivia night now. \n\nThis was one of the hardest sections to decide, as the Amalfi Coast provides postcard views with thrilling turns, and Portugal has a few epic rides of its own. But we’ll go with the one that many call the greatest driving road in the world — just don’t ask us to pronounce it.  \n\nRoughly 93 miles long, it’s not a week-long trek like others on this list, but it’s one that you’ve definitely got to try someday. However, it’s only open June to October each year.  \n\nYou’ll go through hairpin turns, tunnels and hundreds of small bridges and hit a top altitude of just over 1.2 miles above sea level, making this the ride of a lifetime. \n\nASIA: HO CHI MINH TRAIL, VIETNAM If you’d rather explore in a dirtbike than a comfy cruiser, the historic Ho Chi Minh trail is for you. This route goes from North Vietnam all the way to Ho Chi Minh City. The original trail was a 9,940-mile road system built by the Vietnam People’s Army to transport war supplies to the south. But now, it’s a major attraction for thrill seekers around the world. \n\nYou’ll go through trails, roads, jungles, valleys and plains — perfect for a lightweight bike that can take on some tough terrain. Block off a week and a half to really take in the sights, sounds and tastes of this gem. \n\nAFRICA: KWAZULU-NATAL MIDLANDS, SOUTH AFRICA Known as the Valley of 1000 Hills, this is one of the most scenic drives in the world. If you’re really looking for an adventure, the midlands of the KwaZulu-Natal province in South Africa are where you need to go. With an abundance of incredible scenery and historic culture, the KZN Midlands are becoming a hot spot for riders, hikers and other thrill-seekers.  \n\nNestled between the Drakensberg mountain range and the south coast of the Indian Ocean, this is an unforgettable ride! \n\nAUSTRALIA: GREAT OCEAN ROAD, VICTORIA \nYes, it IS possible to ride in Antarctica. Feasible? Well... that’s another story. Only a handful of people have managed to accomplish this, as the journey to get there — not to mention the below-freezing icy conditions — isn't that accessible. This isn’t for the timid or novice rider, by any means. Deepak Kamath, a rider from India who managed to drive his Bajaj Dominar 400 from the Arctic Circle to Australia, says he lost 24 lbs. from being sick during the treacherous journey through the Drake Passage. \n\nIn 2015, Steph Jeavons made the trek as part of her mission to ride on all seven continents, and you can read about her Antarctica adventures on her blog.  ",
    "addedOn": "2021-01-20 06:30:00"
  },
  {
    "title": "Performance Tuning for Motorcycle Engines",
    "blogCategory": "TUNING",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617370474/stages-of-four-stroke-engines_yndsrz.png",
    "description": "Why Tune?\nThe objective of tuning is to improve the volumetric efficiency of the engine. In other words, the engine will, after tuning, produce more power from the same displacement. For example, a 1000-cc engine may produce 125 hp in stock form and 175 hp after race tuning.\n\nIt is very important to understand that tuning a single item (fitting bigger carbs, for example) may not in itself improve performance but will, used in harmony with other modifications, produce the required results. Also, fitting aftermarket tuning parts may not result in the hp increase the individual items claim to provide. For example, 10 items each claiming a 10 hp increase may not give a total of 100 extra horse power, as they may not work in harmony (i.e., in tune) with each other.\n\nThe Cylinder Head\nThe cylinder head on most modified overhead valve (OHV) engines will typically be gas-flowed, will have larger valves fitted, and will have the cylinder head face skimmed to increase the compression. All of these modifications – with the exception of skimming the head – are to improve gas flow.\n\nThe fuel air mixture travels from the carburetors through the inlet manifold, into the cylinder head via poppet valves. The fuel is directed inside the combustion chamber by the shape of the piston and the internal shape of the cylinder head. The cylinder head is the top of the combustion chamber, closing in the pistons.\n\nModifying the cylinder head (to improve the gas flow) typically involves a process called “porting.” Porting is when you alter the path of the fuel entering the combustion chamber. Fundamentally, porting involves raising the angle at which the fuel/air mix enters the combustion chamber. The higher the fuel comes in, the more power. This process is called increasing the downdraft angle. It also requires thinning the valve guides where they protrude into the port and reshaping the cylinder head where the fuel/air mixture passes the inlet valve. Occasionally, the exhaust port will receive similar treatment. You can make these modifications by hand, with a dye grinder, or with a milling machine.In addition, the OHV operating system will generally be lightened to reduce the total moving mass of the components. To complement the cylinder modifications and the gas flowing, most tuners will fit a new exhaust system and bigger carbs (where fitted).\n\nCamshafts\nRegardless of a camshaft’s location within the engine, it will be replaced or modified on a tuned engine. In general, better camshafts will open the valves more quickly, keep the valves open longer, and cause them to “overlap” more (a condition where both the inlet and exhaust valves are open at the same time).\n\nAlthough it is possible to get camshafts reground to change their shape or profile, it is best to purchase proprietary items from a well-established supplier. The reason for this is simply that grinding the original camshaft will not increase the valve lift (speed of lift and opening duration can be reground) and can, in some cases, cause serious engine damage, as the grinding process can remove any surface hardness the manufacturer saw fit to include in its camshaft specification.\n\nGreat Power Requires Great Upgradeability: Cylinders, Pistons, Cranks, and Rods\nAs the power output increases, so too does the load or strain on the components. As such, it is necessary to upgrade some highly stressed components to cope with the extra power and associated heat generated.\n\nFitting lighter, stronger pistons is necessary on most tuned engines, as they are subject to increased heat and higher stresses (often as a result of a higher operating rpm).\n\nDue to the higher rpm achieved with tuning, the connecting rods should also be replaced with high-performance units such as billet steel, aluminum (drag racing typical), or titanium rods.\n\nIn very high performance tuning, the crankshaft must be replaced or modified. One-piece crankshafts are favored by tuners, but modifications to the stock cranks, including welding the crank pins into place and shot peening, are possible.",
    "addedOn": "2021-02-20 06:30:00"
  },
  {
    "title": "Performance Tuning for Motorcycle Engines",
    "blogCategory": "BRAND",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617370663/brands_tmu5pr.jpg",
    "description": "If you're thinking about getting a motorbike, it is important to pick out one of the most reliable brands on the road.\n\nWith all the different motorcycle brands out there, how do you know which is the best?\n\nConsumer reports found that owners of Harley-Davidson and BMW motorcycles were the most satisfied with their bikes.Honda & Yamaha have the Most Sales. Kawasaki & Yamaha for Best Performance and Track Racing. Honda & Yamaha for Best Chassis. Suzuki for most affordable and cheapest of the Japanese.\n\nDeciding which bike is best for you depends on how you use it, what your aesthetic is, and your experience as a rider.\n\nEach of the 20 best motorcycle brands started differently and offer a different customer experience.Hero is an Indian motorcycle and scooter manufacturer based in New Delhi, India. The company is the largest two-wheeler manufacturer in the world, and also in India, where it has a market share of about 46% in the two-wheeler category.Bimota is a small Italian manufacturer of custom and production motorcycles. It was founded in 1973 in Rimini, Italy by Valerio Bianchi, Giuseppe Morri, and Massimo Tamburini. The company name is a portmanteau derived from the first two letters of each of the three founders' surnames, Bianchi Morri Tamburini.Victory Motorcycles was an American motorcycle manufacturer with its final assembly facility in Spirit Lake, Dickinson County, northwestern Iowa, United States. It began production of its vehicles in 1998 and began winding down operations in January 2017.\n\nIts parent company, Polaris Industries, created Victory following the modern success of Harley-Davidson. Victory's motorcycles were designed to compete directly with Harley-Davidson and similar American-style motorcycle brands, with V-twin engines and touring, sport-touring, and cruiser configurations. The first Victory, the V92C, was announced in 1997 and began selling in 1998. The Victory was profitable for a number of years (beginning in 2002) but failed to turn a profit three of its last five years.Cagiva was an Italian motorcycle manufacturer. It was founded in 1950 by Giovanni Castiglioni in Varese, originally producing small metal components. Giovanni's sons, Claudio and Gianfranco Castiglioni went into the motorcycle industry in 1978. The name is a portmanteau derived from the founder's name 'Giovanni Castiglioni' and the founding location, i.e. Castiglioni Giovanni Varese.Bajaj is a global two-wheeler and three-wheeler Indian manufacturing company. Bajaj Auto is the world's sixth-largest manufacturer of motorcycles and the second-largest in India. It is the world's largest three-wheeler manufacturer.",
    "addedOn": "2021-03-20 06:30:00"
  }
]