[
  {
    "title": "2021 MV Agusta Dragster RR SCS RC First Look ",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617366154/2021-MV-Agusta-Dragster-RR-SCS-RC-first-look-limited-edition-urban-sport-motorcycle-19-630x420_ntjnzt.jpg",
    "description": "The 2021 MV Agusta Dragster RR SCS RC is the new flagship of the urban-brawling Dragster lineup. The RC stands for Reparto Corse, and the Racing Department adds to the fun with this distinctive model. Time to dive in and see what the alphabet soup is all about.The 798cc inline-3 gets updates this year to meet Euro 5 standards. The focus is on efficiency, with slipperier motor internals. New bearings for the crankshaft, rod, and countershaft offer less friction, improved reliability, and quieter operation. The tappets are DLC-coated, and the valve guides are sintered. The exhaust headers and the muffler are also new. To work with these changes, the engine management software has been reworked.\nIf you want 10 additional horsepower, cut loose for the Racing Kit. The Racing Kit consists of an SC-Project Titanium muffler that is nearly 18 pounds lighter, plus an ECU with dedicated software. The power increase beginning at 10,000 rpm, and boosts both torque and horsepower. It all comes in a bespoke box with a limited edition certificate of origin.\nThe SCS in the name means this Dragster has an automatic clutch, and it gets a new pressure plate. The Rekluse RadiusCX clutch is a centrifugal design. You have to neither pull in the clutch when coming to a start nor let it out to get going. This is a particularly helpful feature for the urban stop-and-go environments the Dragster is designed to excel in. There is also a new electronic gear sensor to improve the action of the quickshifter.\nMore power requires a more rigid frame, and MV Agusta has made provisions. The new frame plates that hold the trellis frame together have more longitudinal and torsional stiffness than last year’s Dragster.\nChanging the 2021 MV Agusta Dragster RR SCS RC’s chassis means new suspension settings. The shock gets a new link, with theA new IMU works with the full-feature electronics suite. The traction control has eight levels and is cornering aware. The Continental MK100 ABS software also knows if you’re leaning over and adjusts the Brembo calipers’ actuation accordingly. Other electronic rider aids include lift mitigation for both wheels, torque control, launch control, and cruise control.\nA 5.5-inch TFT dash and control pods on the handlebar make it easier to manage the electronic features. The dash is also Bluetooth-equipped, so it can converse with your smartphone.\n Marzocchi fork and Sachs shock getting new settings.Creature comforts have not been ignored. The RC has new seat foam.\nOnly 200 number examples of the 2021 MV Agusta Dragster RR SCS RC will be produced. We have seen how quickly limited edition MVs sell, so don’t say you weren’t warned. You’ll be reminded on every ride that you’re on a limited-edition motorcycle, thanks to the numbered plaque on the handlebar clamp, just above the eight-position adjustable electronic steering damper.\nWe have tested the MV Agusta Dragster.\n2021 MV Agusta Dragster RR SCS RC Specs\nENGINE\nType: Inline-3\nDisplacement: 798cc\nBore x stroke: 79 x 54.3mm\nMaximum power (standard): 140 horsepower @ 12,300 rpm\nMaximum power (w/ Racing Kit): 150 horsepower @ 12,800 rpm\nMaximum torque: 63 ft-lbs @ 8500 rpm\nMaximum speed: 152 mph\nRedline: 13,200 rpm\nCompression ratio: 13.3:1\nFueling: Mikuni throttle bodies w/ Eldor Nemo 2.1 ECU\nValvetrain: DOHC; 4vpc\nCooling: Liquid and oil\nTransmission: Cassette-style 6-speed w/ quickshifter\nClutch: Wet multi-disc SCS 2.0 Radius CX automatic clutch w/ hydraulic actuation\nFinal drive: Chain\nCHASSIS\nFrame: Tubular steel trellis w/ aluminum swingarm\nFront suspension; travel: Fully adjustable Marzocchi inverted 43mm aluminum fork w/ DLC treatment; 4.9 inches\nRear suspension; travel: Linkage-assisted fully adjustable Sachs shock; 5.1 inches\nWheels: Forged aluminum\nFront wheel: 17 x 3.50\nRear wheel: 17 x 6.00\nTires: Pirelli Diablo Rosso III\nFront tire: 120/70 x 17\nRear tire: 200/55 x 17\nFront brakes: 320mm floating discs w/ radially mounted 4-piston Brembo calipers and radial-pump Brembo master cylinder\nRear brake: 220mm disc w/ 2-piston Brembo caliper\nABS: Cornering-aware Continental MK100 w/ rear wheel lift mitigation\nDIMENSIONS and CAPACITIES\nWheelbase: 55.1 inches\nTrail: 4.1 inches\nSeat height: 33.3 inches\nFuel tank capacity: 4.4 gallons\nEstimated fuel consumption: 48 mpg\nCurb weight: N/A\nColor: Ago Silver/Glossy Black/Ago Red",
    "addedOn": "2021-02-20 06:30:00"
  },
  {
    "title": "2021 MV Agusta Brutale 800 Lineup First Look ",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617366389/2021-MV-Agusta-RR-SCS-First-Look-naked-upright-sport-motorcycle-5-1536x1024_un8iyz.jpg",
    "description": "The 2021 MV Agusta Brutale 800 lineup includes a new model—the Brutale Rosso—that is aimed at urban riders and those who don’t quite have the financial horsepower of the most well-heeled MV Agusta buyers. MV has provided several significant upgrades to the Brutale 800s, from the motor to the chassis. Let’s work through the changes, and take a closer look at the new 2021 MV Agusta Brutale Rosso, as well as the returning Brutale RR and RR SCS. Most of the upgrades apply to all three models, and we’ll call out whenever one doesn’t.The differentiation between the three 2021 MV Agusta Brutale 800s is easy. The Rosso is a somewhat lower-spec “budget” model that is about 20 percent less expensive than the RR. The RR is the traditionally high-end Brutale 800, while the RR SCS adds the unconventional fully automatic Radius CX clutch designed in conjunction with Rekluse.\n\nThe latest inline-3 Brutale motor is now Euro 5 compliant. Euro 5 compliance has been a common theme in 2021, and MV Agusta doesn’t get an exemption.\nEngine friction reduction efforts were made throughout the 798cc triple. The connecting rod and countershaft bearings are new, as are the crankshaft main bearings. Additionally, there are new DLC-coated tappets and sintered valve guides.New fuel injectors boast a 14 percent increase in pressure.\nThe exhaust collector and muffler are new. According to an MV Agusta spokesman, the new exhaust system is designed “to improve engine tuning and optimize power [and] torque curves.” The result is a motor that puts out a peak of 140 horsepower and 64 ft-lbs of torque at five-figure rev counts. The Rosso is considerably detuned compared to the RR and RR SCS.\nThe clutches have been upgraded. The standard clutch has improved engagement thanks to a new basket, and the SCS has a new pressure plate. A quickshifter is standard on the Brutale 800s, along with a new EAS 3.0 electronic gear sensor.The 2021 MV Agusta Brutale 800s get new engine management algorithms. The goal is a more direct feel between the throttle and the rear wheel.\nThe steel trellis frame has new frame plates. To make the 800s more stable, the new side plates have added torsional and longitudinal stiffness.\nWith the new frame setup comes new suspension settings. There’s a new linkage system for the shock, and suspension travel is increased by 0.2 inches. Otherwise, the standard settings and springs have been changed to reflect other chassis alterations.MV Agusta worked with e-Novia to produce a new six-axis IMU that is specifically for the 800s. The new IMU allows for more precision and accuracy in traction control settings, wheelie control, and ABS behavior.\nA new 5.5-inch TFT dash and switchgear make it easier to manage the electronics suite. GPS, Bluetooth, a Mobisat tracker (crash detection and theft warning), and MV Ride app are all integrated into the Brutale 800s, though the Rosso owner has to live without the Mobisat tracker.The Continental MK100 ABS module is now employed by MV Agusta on the 800s. It is a cornering-aware system.\nOther updates include a cornering-aware LED headlight and improved seat padding.\nThe 2021 MV Agusta Brutale Rosso’s most notable difference from its RR brothers is a lower revving motor. The redline drops by 1200 rpm to 12,000 on the Rosso. The RRs peak at 140 horsepower at 12,300 rpm, compared to 112 horsepower at 11,000 rpm for the Rosso. The RRs’ top speed is 152 mph, while the Rosso rider will have to make do with a 147 mph top speed. There’s also a detuning option for A2 license-holders, though we almost certainly won’t see it in the United States.The Rosso is more environmentally friendly than the RRs. The Rosso gets 46 mpg, compared to 40 mpg on the RRs, and the Rosso puts out fewer CO2 emissions.\nAlthough the Rosso has the same suspension as the RRs, the Marzocchi fork tubes on the Rosso lacks DLC coating.The Rosso has Bridgestone Battlax Hypersport S22 tires. The RRs use Pirelli Diablo Rosso III rubber.\nAlthough we don’t have US prices for the 2021 MV Agusta Brutale 800 lineup, we can tell you how much they will run in the United Kingdom. We also don’t have an arrival date in the US for these three Brutales.\n2021 MV Agusta Brutale Rosso (Brutale RR and Brutale RR SCS) Specs\nENGINE\nType: Inline-3\nDisplacement: 798cc\nBore x stroke: 79 x 54.3mm\nCompression ratio: 12.3:1 (RR and RR SCS: 13.3:1)\nMaximum power: 112 horsepower @ 11,000 rpm  (RR and RR SCS: 140 horsepower @ 12,300 rpm)\nMaximum torque: 63 ft-lbs @ 8500 rpm (RR and RR SCS: 64 ft/lbs @ 10,250 rpm)\nRedline: 12,000 rpm (RR and RR SCS: 13,200 rpm)\nMaximum speed: 147 mph (RR and RR SCS: 152 mph)\nFueling: Mikuni throttle bodies w/ Eldor Nemo 2.1 ECU\nValvetrain: DOHC; 4vpc\nCooling: Liquid and oil\nTransmission: Cassette-style 6-speed w/ quickshifter\nClutch: Wet multi-disc w/ slipper function and hydraulic actuation (RR SCS: Radius CX automatic clutch w/ hydraulic actuation)\nFinal drive: Chain\nCHASSIS\nFrame: Tubular steel trellis w/ aluminum swingarm\nFront suspension; travel: Fully adjustable Marzocchi inverted 43mm aluminum fork; 4.9 inches (RR and RCS: Fully adjustable Marzocchi inverted 43mm aluminum fork w/ DLC treatment; 4.9 inches)\nRear suspension; travel: Linkage-free fully adjustable Progressive Sachs shock; 5.1 inches\nWheels: Aluminum\nFront wheel: 17 x 3.50\nRear wheel: 17 x 5.50\nTires: Bridgestone Battlax Hypersport S22 (RR and RR SCS: Pirelli Diablo Rosso III)\nFront tire: 120/70 x 17\nRear tire: 180/55 x 17\nFront brakes: 320mm floating discs w/ radially mounted 4-piston Brembo calipers and radial-pump Brembo master cylinder\nRear brake: 220mm disc w/ 2-piston Brembo caliper\nABS: Cornering-aware Continental MK100 ABS w/ rear wheel lift mitigation\nDIMENSIONS and CAPACITIES\nWheelbase: 55.1 inches\nSeat height: 32.7 inches\nFuel tank capacity: 4.4 gallons\nEstimated fuel consumption: 46 mpg (RR and RR SCS: 40 mpg)\nCurb weight: N/A\nCOLORS\n2021 MV Agusta Brutale Rosso: Ago Red\n2021 MV Agusta Brutale RR and RR SCS: Carbon Black Metallic/Avio Grey Metallic; Shock Pearl Red/Avio Grey\nPRICES\n2021 MV Agusta Brutale Rosso Price: £13,400 (US MSRP $TBA)\n2021 MV Agusta Brutale RR Price: £17,000 (US MSRP $TBA)\n2021 MV Agusta Brutale RR SCS Price: £17,500 (US MSRP $TBA)",
    "addedOn": "2021-03-20 06:30:00"
  },
  {
    "title": "2021 Kawasaki KLX230R S First Look",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617366457/2021-Kawasaki-KLX230R-S-First-Look-trail-bike-off-road-motorcycle-7-630x420_aloxg9.jpg",
    "description": "Just a year after the debut of the Kawasaki KLX230R trail bike, we get our first look at the 2021 Kawasaki KLX230R S. While it is closely related to the standard KLX230R, there are some significant differences, so let’s go over them.\n1. Kawasaki has reduced the seat height of the KLX230R by 0.8 inches. The 2021 KLX230R S has a seat height of 35.4 inches, making it accessible to a broader range of riders.\n2. The ergonomics on the KLX230R S are unchanged from the standard version. Although the seat is lower, the rider triangle has not been impacted.3. To get the lower seat height, Kawasaki shortened the suspension travel. There is 1.1-inch less travel at both ends of the 2021 KLX230R S. It is not a short-travel setup, as there is nearly nine inches of wheel travel front and back. That should be more than enough for a trail bike in this class.\n4. Kawasaki didn’t make any other chassis changes, so the geometry is unique to the KLX230R S. Expect noticeably quicker steering on the lower S for three reasons—the rake is tucked in 0.8 degrees, the trail is reduced a hair, and the wheelbase is 0.4 inches shorter. The curb weight is unchanged at 254 pounds.\n5. Technical trails may be a bit more difficult, as ground clearance on the S is one-inch less than on the KLX230R. Taller6. Unnecessary California regulations hobble the versions in that state. To get the California Green Sticker, which allows the motorcycle to be ridden off-road all year long, the California KLX230R S has a steel fuel tank with a locking gas cap, along with a keyed ignition and EFI warning light. All of this nonsense adds 10 pounds to the bike. Generously, Kawasaki doesn’t charge Californians more for this folly.\n7. Otherwise, the S has the same features we enjoyed on the standard R. You get a fuel-injected air-cooled 233cc motor with electric starting, plus a full-size 18-/21-inch wheel combo.\n8. The MSRP of the 2021 Kawasaki KLX230R S is $4399. There’s only one color—Lime Green.\n riders won’t have to pay a price for the shorter seat.2021 Kawasaki KLX230R S Specs\nENGINE\nType: Single-cylinder four-stroke\nDisplacement: 233cc\nBore x stroke: 67.0 x 66.0mm\nCompression ratio: 9.4:1\nValvetrain: SOHC; 2 valves\nCooling: Air\nFueling: EFI w/ 32mm throttle body\nTransmission: 6-speed\nFinal drive: Chain\nCHASSIS\nFrame: Steel perimeter\nFront suspension; travel: Non-adjustable 37mm fork; 8.7 inches\nRear suspension; travel: Linkage-assisted spring-preload adjustable shock; 8.8 inches\nTires: Dunlop Sports D952\nFront tire: 80/100 x 21\nRear tire: 100/100 x 18\nFront brake: 240mm petal disc w/ twin-piston caliper\nRear brake: 220mm petal disc w/ single-piston caliper\nDIMENSIONS and CAPACITIES\nWheelbase: 53.1 inches\nRake: 25.7 degrees\nTrail: 4.3 inches\nSeat height: 35.4 inches\nGround clearance: 10.8 inches\nFuel tank capacity: 1.7 gallons (California: 2.0 gallons)\nCurb weight: 254 pounds (California: 264 pounds)\nColor: Lime Green\n2021 Kawasaki KLX230R S Price:\n$4399 MSRP",
    "addedOn": "2021-01-20 06:30:00"
  },
  {
    "title": "2021 Triumph Speed Triple 1200 RS First Look",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617366608/2021-Triumph-Speed-Triple-1200-RS-First-Look-naked-upright-streetfighter-motorcycle-8-630x420_xh1lt9.jpg",
    "description": "Forget what you know about any previous Triumph Speed Triple. The 2021 Triumph Speed Triple 1200 RS is an all-new naked upright sportbike ready to do battle at the top of its class.\nTriumph proudly boasts that it’s the only brand with a purpose-built open-class streetfighter not based on a superbike. With that in mind, let’s see what this new streetfighting beast is.\n1. The all-new 1160cc triple puts out a claimed 176 horsepower. According to Triumph, that’s a staggering 29 horsepower boost over the previous versions. According to the dyno, the big difference between the old motor and the new one is from 6250 rpm up—in both torque and horsepower production. From there, the new Street Triple 1200 has significant horsepower gains until it signs off at 11,150 rpm—650 rpm higher than before.\n\n2. Triumph got there by going to a dramatically oversquare configuration—the stroke is shortened over 11mm while the displacement increased 110cc. You have to wait until the motor is spinning 10,750 rpm to hit the horsepower peak, with the torque maxing out at a lofty 9003. In addition to putting out more power, the new motor also spins up more quickly. Triumph claims the 1200 has 12 percent less inertia than the 1050. Also, the DOHC motor breaths more freely at both the intake and exhaust. This makes it much easier to spin the rev count up to five figures and get all the power you paid for. Twin-tip spark plugs and a new ignition system add to the motor’s efficiency.\n4. Part of the powertrain inertia reduction comes from a lighter clutch assembly. It’s an assist-or-slipper design with fewer, grippier clutch plates. The 6-speed transmission is also a new design, with a focus on compactness and slicker shifting. There’s a quickshifter, of course, and it monitors how fast you’re going for smoother shifts.\n5. The chassis is also new, with a 17 percent weight loss in the cast aluminum frame. In total, the 2021 Triumph Street Triple 1200 RS is 22 pounds lighter than last year’s 1050. Triumph is finally starting to quote curb weights on its motorcycles and tells us the 1200 tips the scales at 437 pounds with the 4.1-gallon tank filled with high test.\n6. The loss of 22 pounds and the gain of 29 horsepower results in a Speed Triple with nearly double the power-to-weight ratio of the Speed Triple that debuted in 1994. The power-to-weight ratio is up 25-percent compared to last year.\n0 rpm when it produces 92 ft-lbs of muscle.7. With less weight aiding in agility, the 1200 has more stable geometry. The rake is stretched out one full degree from last year, and the trail increased by a half-inch. Keep in mind that the rake is still an aggressive 23.9 degrees.\n8. The fully adjustable high-end, track-ready Öhlins NIX30 fork and TTX36 shock are carried over from the previous RS. However, rear-wheel travel is reduced by a half-inch, and the suspension settings are completely different due to the 1200’s lighter weight and additional power.\n9. The 2021 Speed Triple 1200 RS gets a handlebar that is a half-inch wider. The footpegs have been moved inward to give the RS more cornering clearance while retaining legroom. The seat height is 0.3 inches higher than before.\n10. Metzeler Racetec RR tires get the nod. These tires are optimized for street performance. For the track, Triumph recommends Pirelli Diablo Supercorsa SC2 rubber. The tires are mounted on new cast aluminum V-spoke wheels.\n11. Brembo braking systems do the slowing at both ends. The front gets monobloc Stylema calipers, along with a radially mounted master cylinder. The brake lever can be adjusted for position and actuation ratio. The new rear disc has a 35mm smaller diameter, and is worked on by a two-piston Brembo caliper.\n12. ABS is provided by a Continental MIB-EVO ABS unit working with a six-axis IMU. There are two levels of ABS intervention—Road and Track—that are adjustable independent of the ride modes. According to Triumph, the ABS is “virtually imperceptible during fast track riding” in the Track mode.\n13. Four levels of traction control are available, and each takes advantage of IMU information. The four levels—Track, Sport, Road, and Rain—are individually selectable, as well as being tied into the overall riding modes. Wheelie control is integrated into traction control and not independently adjustable.\n14. There are four preset riding modes, all fine-tunable, along with a rider-configured mode. The riding modes are Track, Sport, Road, and Rain. In addition to adjusting the ABS, traction control, and wheelie control, the riding modes tailor the throttle response. Each parameter within the four modes can be changed on-the-fly. The Rider mode gives the pilot a blank canvas to tailor a mode from scratch. Full power is available in all modes, except Rain. Rain knocks the peak power down to 98 horsepower.\n15. A new five-inch TFT screen is employed to make it easier for the rider to work the adjustments. The interface software is new, as is the backlit switchgear to control it. There are two display themes, and modifications are available within the themes. Triumph’s proprietary My Triumph app allows your smartphone to communicate with the 2021 Triumph Street Triple 1200 RS. Music, telephone, and GoPro operation are included in the package, as well as turn-by-turn navigation.\n16. Keyless ignition and cruise control are two convenience-oriented standard features.\n17. The bodywork is new, and there are two color packages to choose from. You get to choose between Sapphire Black with red and silver graphics, and Matt Silver Ice with black, silver, and yellow graphics. Lighting is all LED.\n18. A wide range of factory accessories will be available. They range from luggage to machined brake reservoirs.\n19. The 2021 Triumph Speed Triple 1200 RS is the only flavor of Speed Triple this year. The MSRP is $18,300—an increase of $1800 over last year’s RS. There is no base model, as in past years. You’ll be able to see the new 1200 RS in person at your local Triumph dealer in late March.\n2021 Triumph Speed Triple 1200 RS Specs\nENGINE\nType: Inline-3\nDisplacement: 1160cc\nBore x stroke: 90 x 60.8mm\nMaximum power: 176 horsepower @ 10,750 rpm\nMaximum torque: 92 ft-lbs @ 9000 rpm\nCompression ratio: 13.2:1\nTransmission: 6-speed w/ quickshifter\nClutch: Wet multiplate w/ assist-and-slipper functions\nFinal drive: X-ring chain\nCHASSIS\nFrame: Tubular aluminum twin-spar\nSwingarm: Aluminum single-sided\nFront suspension; travel: Fully adjustable Öhlins 43mm NIX inverted fork; 4.7 inches\nRear suspension; travel: Fully adjustable linkage-assisted Öhlins TTX36 shock; 4.7 inches\nWheels: Cast aluminum\nFront wheel: 17 x 3.5”\nRear wheel: 17 x 6.0”\nTires: Metzeler Racetec RR K3\nFront tire: 120/70 x 17\nRear tire: 190/55 x 17\nFront brakes: 320mm floating discs w/ radially mounted Brembo Stylema 4-piston monobloc calipers and radially mounted master cylinder\nRear brake: 220mm disc w/ Brembo 2-piston caliper\nABS: Cornering ABS\nDIMENSIONS and CAPACITIES\nWheelbase: 56.9 inches\nRake: 23.9 degrees\nTrail: 4.1 inches\nSeat height: 32.7 inches\nFuel capacity: 4.1 gallons\nEstimated fuel consumption: 50 mpg\nCurb weight: 437 pounds\nColors: Sapphire Black; Matt Silver Ice\n2021 Triumph Speed Triple 1200 RS Price:\n$18,300 MSRP",
    "addedOn": "2021-01-26 06:30:00"
  },
  {
    "title": "2021 Aprilia Tuono V4 Lineup First Look",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617366670/2021-Aprilia-Tuono-V4-Factory-First-Look-superbike-upright-motorcycle-630x420_smpkyh.jpg",
    "description": "The Aprilia Tuono V4 has earned a reputation for being an uncompromisingly high-performance upright sportbike. Note that we didn’t say naked, as it has a flyscreen, mid fairing, and chin fairing. The 2021 Aprilia Tuono V4 will be a bit more civilized than previous editions of the canyon and track-ready brawler. Let’s dive into the latest Tuono V4 (we last reviewed an Aprilia Tuono V4 in 2019).\nThere are two flavors of 2021 Aprilia Tuono V4—standard and Factory. The primary differentiator between the two Tuono V4s is that the Factory gets Öhlins Smart EC 2.0 semi-active suspension. The standard Tuono V4 has traditional fully adjustable suspension, sans electronic.\n\nThe new Tuono V4 sports upgraded electronics. The new Marelli 11MP ECU and six-axis IMU make possible six riding modes for 2021. There are three track modes, with two of them customizable. Aprilia provides two preset street modes, along with one that is user-configurable. Adjustments can be made to engine braking, ABS, traction control, and wheelie control, among others. We saw these same updates on the 2021 Aprilia RSV4 superbikes.\nAprilia updated the swingarm for the 2021 Tuono V4s. It is lighter and has a brace to increase rigidity to aid in acceleration stability. The new geometry comes straight from World Superbike.\nThe 2021 Aprilia Tuono V4s get relaxed ergonomics. The handlebar is taller than before, and the fuel tank has a shape to give the rider additional room. The fairing offers more wind protection, as well as housing new LED lighting. There are also corner-aware lights so you can see through turns better after dark.\nAprilia is making things more comfortable for the passenger. The seat is larger this year for the pillion rider, and the tail section is new. Also, the footpegs are lower, providing a bit more legroom.\nIf the idea of sport-touring on the Aprilia Tuono V4 appeals to you, asymmetrical panniers are available for 2021. \nThe two 2021 Aprilia Tuono V4s have distinct color schemes. The Factory comes in Aprilia Black, while the standard version has two color choices—Tarmac Grey and Glacier White. Right now, we only have a photo of the Factory model.\nBe patient—the new Tuono V4s won’t be available until June in the United States. When they arrive, the 2021 Aprilia Tuono V4 will have a price tag of $15,999, and the Factory’s MSRP is $19,499.",
    "addedOn": "2021-03-20 06:30:00"
  },
  {
    "title": "2021 Honda CRF450 Rally First Look",
    "imageUrl": "https://res.cloudinary.com/elizabetak/image/upload/v1617366741/2021-Honda-CRF450-Rally-First-Look-Dakar-Rally-motorcycle-Brabec-2-630x420_muomar.jpg",
    "description": "Ricky Brabec returns to the Dakar Rally in Saudi Arabia as the defending champion. In 2020, Brabec became the first American to win the Dakar Rally, and the Honda CRF450 Rally broke KTM’s win streak of 18 victories in the Dakar Rally. Let’s take a look at the motorcycle that he will be bringing to the starting line on January 2 in Jeddah.\nKeep in mind that the 2021 Honda CRF450 Rally is a works bike. Honda tells us that it is as trick as Marc Márquez’ RC213V. There are plenty of secrets lurking behind the plastic, carbon fiber, and aluminum.\nIt’s easy to think the CRF450 Rally is based on the CRF450R platform—it is not. Right away, you’ll notice two things about the motor. The CRF450 Rally has a DOHC motor, while the CRF450R uses Honda’s single-cam Unicam design. Plus, the bore and stroke on the Rally bike are different. The bore on the CRF450 Rally is one millimeter larger, and the stroke is 1.3mm shorter.\nHonda claims 60 peak horsepower from the Rally motor. It runs a Termignoni muffler after a Goshi.\nThat’s a 6-speed transmission on the Rally. The CRF450R and the CRF450RX use a 5-speed transmission. However, you will find a 6-speed on the CRF450X and CRF450RL. The clutch is an FCC unit from Japan.\nThe 2021 Honda CRF450 Rally uses Showa suspension. While the front suspension travel on the Rally is the same as the R, the Rally has 0.4 inches less wheel travel than the R.\nWith high speed, the Rally has a larger front brake. The Rally’s disc is 300mm in diameter, compared to just 260mm on the CRF450R.\nThere are two plastic fuel tanks on the CRF450 Rally. They carry 9.2 gallons of fuel. The 450R motocrosser has a titanium fuel tank wThe Rally uses beefy Michelin Desert Race tires mounted on heavy-duty D.I.D DirtStar ST-X rims.\nAlthough you can buy a 2021 Honda CRF450RWE Works Edition motocrosser for $12,380, there’s nothing on the Honda showroom floor that’s anything like the 2021 Honda CRF450 Rally at any price. If you want to ride the Rally in competition, your name has to be Ricky Brabec, Nacho Cornejo, Kevin Benavides, or Joan Barreda.\n2021 Honda CRF450 Rally Specs\nENGINE\nType: Single-cylinder 4-stroke\nDisplacement: 449cc\nBore x stroke: 97.0 x 60.8mm\nMaximum power: 60 horsepower\nFueling: EFI\nAir filtration: TwinAir\nExhaust: Goshi\nMuffler: Termignoni\nTransmission: 6-speed\nClutch: F.C.C.\nLubrication: Motul\nSprockets: Supersprox\nFinal drive: Chain\nCHASSIS\nFrame: Twin-spar aluminum\nSubframe: Carbon fiber\nHandlebar: Renthal\nSeat: Noguchi\nFront suspension; travel: Inverted Showa fork; 12.2 inches\nRear suspension; travel: Showa shock; 12.0 inches\nWheels: D.I.D DirtStar ST-X\nTire: Michelin Desert Race\nFront tire: 90/90 x 21\nRear tire: 140/80 x 18\nFront brake: 300mm disc w/ 2-piston caliper\nRear brake: 240mm disc w/ single-piston caliper\nFuel capacity: 9.2 gallons (two plastic fuel tanks)\nLighting: PIAAith a capacity of 1.7 gallons.",
    "addedOn": "2021-03-20 06:30:00"
  }
]
